---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterNumericRuleEvaluator
source: html/45bf2613-cfba-109f-81d3-dd58c6bcc8dd.htm
---
# FilterNumericRuleEvaluator Methods

Derived classes should override this method to implement the desired test.